In [49]:
import numpy as np
import pandas as pd

In [50]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'A':10,'B':20,'C':30}
tp=(3,2,1)

In [51]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [52]:
pd.Series(data=labels, index=tp)

3    a
2    b
1    c
dtype: object

In [53]:
pd.Series(labels,tp)

3    a
2    b
1    c
dtype: object

In [54]:
#d = {'A':10,'B':20,'C':30}
pd.Series(d)

A    10
B    20
C    30
dtype: int64

In [55]:
s1=pd.Series([1,2,3,4], ['ctc','bbsr','jsr','bbi'])
s1

ctc     1
bbsr    2
jsr     3
bbi     4
dtype: int64

In [56]:
s2=pd.Series([1,2,3,4], ['ctc','patna','bbi','delhi'])
s2

ctc      1
patna    2
bbi      3
delhi    4
dtype: int64

In [57]:
s1+s2

bbi      7.0
bbsr     NaN
ctc      2.0
delhi    NaN
jsr      NaN
patna    NaN
dtype: float64

In [58]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(102)

In [59]:
df=pd.DataFrame(data=randn(5,4), index='A B C D E'.split(), columns='P Q R S'.split())

In [60]:
df

          P         Q         R         S
A  1.668068  0.925862  1.057997 -0.920339
B  1.299748  0.331183 -0.509845 -0.903099
C -0.130016 -2.238203  0.973165 -0.024185
D -0.484928 -1.109264 -0.558975  1.042387
E -1.712263  0.136120 -0.464444  0.050980

In [61]:
df['P']

A    1.668068
B    1.299748
C   -0.130016
D   -0.484928
E   -1.712263
Name: P, dtype: float64

In [62]:
df[['P','R']]

          P         R
A  1.668068  1.057997
B  1.299748 -0.509845
C -0.130016  0.973165
D -0.484928 -0.558975
E -1.712263 -0.464444

In [63]:
df['new']=df['P']+df['Q']

In [64]:
df

          P         Q         R         S       new
A  1.668068  0.925862  1.057997 -0.920339  2.593930
B  1.299748  0.331183 -0.509845 -0.903099  1.630931
C -0.130016 -2.238203  0.973165 -0.024185 -2.368220
D -0.484928 -1.109264 -0.558975  1.042387 -1.594192
E -1.712263  0.136120 -0.464444  0.050980 -1.576143

In [65]:
df.drop('new', axis=1, inplace=True)

In [66]:
df

          P         Q         R         S
A  1.668068  0.925862  1.057997 -0.920339
B  1.299748  0.331183 -0.509845 -0.903099
C -0.130016 -2.238203  0.973165 -0.024185
D -0.484928 -1.109264 -0.558975  1.042387
E -1.712263  0.136120 -0.464444  0.050980

In [67]:
df.drop('D')

          P         Q         R         S
A  1.668068  0.925862  1.057997 -0.920339
B  1.299748  0.331183 -0.509845 -0.903099
C -0.130016 -2.238203  0.973165 -0.024185
E -1.712263  0.136120 -0.464444  0.050980

In [68]:
df.loc['A']

P    1.668068
Q    0.925862
R    1.057997
S   -0.920339
Name: A, dtype: float64

In [69]:
df.iloc[0]

P    1.668068
Q    0.925862
R    1.057997
S   -0.920339
Name: A, dtype: float64

In [70]:
df.loc['B','R']

-0.5098449678999922

In [71]:
df.loc[['A','B'],['R','S']]

          R         S
A  1.057997 -0.920339
B -0.509845 -0.903099

In [72]:
df

          P         Q         R         S
A  1.668068  0.925862  1.057997 -0.920339
B  1.299748  0.331183 -0.509845 -0.903099
C -0.130016 -2.238203  0.973165 -0.024185
D -0.484928 -1.109264 -0.558975  1.042387
E -1.712263  0.136120 -0.464444  0.050980

In [73]:
df[df>0]

          P         Q         R         S
A  1.668068  0.925862  1.057997       NaN
B  1.299748  0.331183       NaN       NaN
C       NaN       NaN  0.973165       NaN
D       NaN       NaN       NaN  1.042387
E       NaN  0.136120       NaN  0.050980

In [74]:
df[df['P']>1]

          P         Q         R         S
A  1.668068  0.925862  1.057997 -0.920339
B  1.299748  0.331183 -0.509845 -0.903099

In [77]:
df[df['P']>1]['S']

A   -0.920339
B   -0.903099
Name: S, dtype: float64

In [79]:
df[df['P']>1][['S','Q']]

          S         Q
A -0.920339  0.925862
B -0.903099  0.331183

In [80]:
df

          P         Q         R         S
A  1.668068  0.925862  1.057997 -0.920339
B  1.299748  0.331183 -0.509845 -0.903099
C -0.130016 -2.238203  0.973165 -0.024185
D -0.484928 -1.109264 -0.558975  1.042387
E -1.712263  0.136120 -0.464444  0.050980

In [81]:
df.reset_index()

  index         P         Q         R         S
0     A  1.668068  0.925862  1.057997 -0.920339
1     B  1.299748  0.331183 -0.509845 -0.903099
2     C -0.130016 -2.238203  0.973165 -0.024185
3     D -0.484928 -1.109264 -0.558975  1.042387
4     E -1.712263  0.136120 -0.464444  0.050980

In [83]:
newind='CA NY WY OR CO'.split()

In [84]:
df['States']=newind
df

          P         Q         R         S States
A  1.668068  0.925862  1.057997 -0.920339     CA
B  1.299748  0.331183 -0.509845 -0.903099     NY
C -0.130016 -2.238203  0.973165 -0.024185     WY
D -0.484928 -1.109264 -0.558975  1.042387     OR
E -1.712263  0.136120 -0.464444  0.050980     CO

In [86]:
df.set_index('States')

               P         Q         R         S
States
CA      1.668068  0.925862  1.057997 -0.920339
NY      1.299748  0.331183 -0.509845 -0.903099
WY     -0.130016 -2.238203  0.973165 -0.024185
OR     -0.484928 -1.109264 -0.558975  1.042387
CO     -1.712263  0.136120 -0.464444  0.050980

In [87]:
df=df[['P','R','S','Q']]

In [88]:
df

          P         R         S         Q
A  1.668068  1.057997 -0.920339  0.925862
B  1.299748 -0.509845 -0.903099  0.331183
C -0.130016  0.973165 -0.024185 -2.238203
D -0.484928 -0.558975  1.042387 -1.109264
E -1.712263 -0.464444  0.050980  0.136120

In [89]:
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444], 'col3':['abc','def','ghi','xyz']})

In [90]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [91]:
df1=pd.DataFrame(np.random.randn(20,5))
df1

           0         1         2         3         4
0   1.447899  0.593138 -0.755616 -0.627166  0.884035
1   0.162718 -2.502813  0.410791  0.728750  0.029140
2  -0.291052  0.314293  0.997190  3.428563 -0.578567
3  -0.204163 -1.867169  1.443434  0.403380 -0.690765
4   1.172287 -1.571128  0.801992 -0.571973  1.553394
5   0.701220  1.014993 -0.118042 -1.063891  1.176691
6   1.347619 -0.794300 -1.279943  0.556753 -0.048404
7   0.234364 -0.983657  1.093005 -1.251296  1.481600
8  -0.227293 -0.063780 -0.176185 -2.172674 -1.588957
9  -1.292981 -0.547431 -0.008797 -0.478540 -0.359362
10  0.609151  1.038694  0.098843 -1.109817 -0.754384
11  1.017106 -1.749905 -1.350573  0.033912  0.424447
12 -0.429403 -0.223170  0.231589 -0.895379 -1.000759
13  1.169370  0.786860  0.563006 -1.270066 -0.284836
14  0.268541 -0.750508  0.480002  1.938019 -0.704193
15 -0.230239 -0.013516 -0.490594  0.156247 -0.402487
16  0.278943 -0.064388  1.274979  0.912503 -0.186412
17  0.058773  0.789484  0.979825 -2.650835 -0.306270
18 -0.719729  0.117394 -0.462441 -0.940543 -1.778986
19  0.529387  0.831352 -0.258645  0.167274 -0.593892

In [93]:
df1.head(10)

          0         1         2         3         4
0  1.447899  0.593138 -0.755616 -0.627166  0.884035
1  0.162718 -2.502813  0.410791  0.728750  0.029140
2 -0.291052  0.314293  0.997190  3.428563 -0.578567
3 -0.204163 -1.867169  1.443434  0.403380 -0.690765
4  1.172287 -1.571128  0.801992 -0.571973  1.553394
5  0.701220  1.014993 -0.118042 -1.063891  1.176691
6  1.347619 -0.794300 -1.279943  0.556753 -0.048404
7  0.234364 -0.983657  1.093005 -1.251296  1.481600
8 -0.227293 -0.063780 -0.176185 -2.172674 -1.588957
9 -1.292981 -0.547431 -0.008797 -0.478540 -0.359362

In [99]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [101]:
l=[1,2,3,2,2,3,3,4,3]
x=list(set(l))
x

[1, 2, 3, 4]

In [102]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [103]:
newdf=df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [104]:
def times3(x):
    return x*3

In [105]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [106]:
df['col4']=df['col1'].apply(times3)

In [107]:
df

   col1  col2 col3  col4
0     1   444  abc     3
1     2   555  def     6
2     3   666  ghi     9
3     4   444  xyz    12

In [109]:
df1.sum().sum()

-5.00496478360583

In [110]:
df.isnull()

    col1   col2   col3   col4
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False